Autodesk.Revit.ExportPDFSettings.CopyFrom(Autodesk.Revit.DB.PDFExportOptions)
Copy from other options
options:
Other options
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.ExportPDFSettings.GetOptions
Get options for exporting
Returns:
The options
Since:
2021

Autodesk.Revit.ExportPDFSettings.GetActivePredefinedSettings(Autodesk.Revit.DB.Document)
Get the active settings element in the document
document:
The document to find the active settings
Returns:
The active settings, or nullptr if none
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.ExportPDFSettings.FindByName(Autodesk.Revit.DB.Document,System.String)
Find settings element by settings name
document:
The document to find the settings with the specified name
name:
Name of the settings to find
Returns:
The settings element, or nullptr if not found
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.ExportPDFSettings.IsValidName(Autodesk.Revit.DB.Document,System.String)
Check if the proposed name is valid for the specified document, which means it does not exist
document:
Document to check
name:
Name to check
Returns:
Whether or not the name is valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.ExportPDFSettings.ListNames(Autodesk.Revit.DB.Document)
List all the names of the settings instances in the document
document:
Document where the settings to be found
Returns:
List of names
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.ExportPDFSettings.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.PDFExportOptions)
Create an ExportPDFSettings element in the document with specified settings
document:
Document where the settings will be created
name:
Name to the settings
options:
The options to be set
Returns:
New instance of ExportPDFSettings just created in the document
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name already exists
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2021

Autodesk.Revit.ExportPDFSettings.SettingsName
Name of the settings
Since:
2021

Autodesk.Revit.ExportPDFSettings
Settings for PDF export
Since:
2021